Revit 2027 API
BuiltInFailures.StairRampFailures.WinderLegsAngleTooGreatOrRunWidthTooSmallFailure Property
 The angle between two consecutive legs are too great or the runwidth is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderLegsAngleTooGreatOrRunWidthTooSmallFailure { get; }
Public Shared ReadOnly Property WinderLegsAngleTooGreatOrRunWidthTooSmallFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderLegsAngleTooGreatOrRunWidthTooSmallFailure {
	FailureDefinitionId^ get ();
}
static member WinderLegsAngleTooGreatOrRunWidthTooSmallFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace